[{"name": " Green Hope Foundation", "description": "The purpose, objectives, mission and/or mandate of organization is outlined here:\r\nOur mission is to engage all sections of..."}, {"name": "A Dialogue for Black Women", "description": "\"A Dialogue for Black Women 2018-2019'. The purpose of this initative will be to create a safe space in which Black women can..."}, {"name": "A New Perspective", "description": "“A New Perspective”, ANP, aims to raise awareness regarding the real issues affecting Toronto’s homeless community. It..."}, {"name": "Academic Alliance at the University of Toronto", "description": "Academic Alliance at the University of Toronto aims to provide immediate front-line peer support to students who are..."}, {"name": "Acid Survivors Help Organization", "description": "The purpose of Acid Survivors Help Organization is to fundraise and spread awareness to combat against acid attack violence..."}, {"name": "Activists Against Poverty in Guyana", "description": "Guyana is a country with a huge poverty problem that contributes to the 2nd highest suicide rate in the world. The purpose of..."}, {"name": "Afghan Students' Association ", "description": "The Afghan Students Association (ASA) aims to actively represent the voice and the interests of Afghan students at the..."}, {"name": "Alliance for a Just Toronto (AJT)", "description": "AJT is a collective of students, artists and community members organizing to build grassroots power and push city hall to..."}, {"name": "Amnesty International University of Toronto Mississauga", "description": "Purpose of Amnesty UTM:\r\na.\tTo promote awareness amongst the students on campus for human rights violations across the world..."}, {"name": "Amnesty International, University of Toronto Chapter", "description": "Amnesty International at the University of Toronto is a student-based chapter of Amnesty International, a worldwide nonprofit..."}, {"name": "Animal Liberation", "description": "The University of Toronto Animal Liberation club aims to aid in the fight for animal liberation through hosting events,..."}, {"name": "Armenian Students' Association of the University of Toronto", "description": "The Armenian Student's Association at the University of Toronto Saint George campus aims to gather Armenian students in order..."}, {"name": "Artists Anonymous", "description": "Artists Anonymous is an organization that aims to explore and promote an inclusive space for all students to express..."}, {"name": "Asian Canadian Medical Student Association ", "description": "The mission of the Asian Canadian Medical Student Association (ACMSA) is to address the unique health challenges of Asian..."}, {"name": "Association for ALL Immigrants ", "description": "The purpose of this association is to provide support to ALL immigrants. This includes refugees, landed immigrants, sponsored..."}, {"name": "Association of Palestinian Students", "description": "The Association of Palestinian Students is a humanitarian none for profit organization that focuses on the historical and..."}, {"name": "Association of Part-Time Undergraduate Students (APUS)", "description": "The mission of the Association of Part-time Undergraduate Students (APUS) is to ensure that part-time undergraduate students..."}, {"name": "Autism Alliance", "description": "Our goal is to support individuals with autism spectrum disorders by providing them with the opportunity to be paired up with..."}, {"name": "Autism Without Limits", "description": "Our goal is to disseminate information about autism into our campus and student communities through awareness activities and..."}, {"name": "Bahar Charity Group", "description": "Bahar Charity group is an Iranian non-profit group without any political and religious attachments. The purpose of this group..."}, {"name": "Because I am a Girl", "description": "A Plan International Champion of Change Club at the University of Toronto Mississauga dedicated to promoting girls' rights and..."}, {"name": "Because I am a Girl- UTSC Chapter", "description": "Champions of Change, formerly known as Because I am a Girl,  is a Non-Profit initiative under Plan International Canada, and..."}, {"name": "Ben's Friends", "description": "Our mission at Ben's Friends is to create patient-to-patient support communities for people with rare diseases. At the..."}, {"name": "Black Graduate Students Association", "description": "The Black Graduate Students Association (BGSA) will engage in powerful discourse of local and international issues and..."}, {"name": "Black Social Work Student Association", "description": "The Black Social Work Student Association is an empowerment, advocacy and support group, which acts as a representative body..."}, {"name": "BORDERLESS", "description": "BORDERLESS is a student club that aims to raise awareness and funds for often overlooked refugee crises around the world and..."}, {"name": "Bridges to Community Canada - U of T Chapter", "description": "Bridges to Community Canada is a service learning group that takes part in an annual trip to developing countries in hopes of..."}, {"name": "Building Our Safe School ", "description": "BOSS seeks to: \r\n•\tCombat bullying in the campus setting and in local community schools\r\n•\tForm a relationship between U..."}, {"name": "Campus Lions Club", "description": "Our organization does hands-on volunteer work in Toronto. We participate in a broad range of volunteering activities, such as..."}, {"name": "Canadian Foundation for AIDS Research", "description": "CANFAR Clubs is a national peer-to-peer program aimed at fostering the next generation of young leaders in activism,..."}, {"name": "Canadian Students for Sensible Drug Policy Chapter", "description": "Canadian Students for Sensible Drug Policy (CSSDP) is a grassroots network comprised of youth and students who are concerned..."}, {"name": "Canadian Voice of Women for Peace", "description": "VOW is one of the non-governmental organizations (NGO) cited by UNESCO’s standing committee in the working group report..."}, {"name": "Cards4Humanity", "description": "Our mission is to eliminate the stigma surrounded around giving money to people asking on the streets. By instead giving them..."}, {"name": "Changing Impressions", "description": "Changing Impressions – we are a student-run club advocating for mental health awareness on campus. Our focus will be to help..."}, {"name": "Child Rescue Coalition", "description": "Child Rescue Coalition is a non-profit organization located in Florida that legally monitors online activity to identify child..."}, {"name": "Choose Humanity", "description": "Choose Humanity is an initiative aimed at creating awareness on the human rights crisis in China, involving the Chinese..."}, {"name": "CivicSpark at University of Toronto", "description": "CivicSpark at University of Toronto’s purpose is to provide a non-partisan platform to empower youth to engage with regional..."}, {"name": "Communist Party of Canada Club", "description": "Political"}, {"name": "Congenital Heart Defects Awareness", "description": "UofT - CoHDe Awareness aims to advocate and spread awareness with regards to congenital heart diseases affecting both the..."}, {"name": "Diaspora and Transnational Studies Student's Union", "description": "The vision of the Union of Diaspora and Transnational Students is to provide a milieu of discussion and intellectual..."}, {"name": "Dig In! Campus Agriculture Network", "description": "We aim to be a weaver organization bringing together communities across all three campuses to ensure access to affordable,..."}, {"name": "Dignitas International Youth Club", "description": "We are the University of Toronto chapter of the Dignitas International organization.  Dignitas International is an NGO that..."}, {"name": "Documentary Club UofT ", "description": "DocU brings students together to watch documentaries about social, political and cultural issues. Guests such as filmmakers,..."}, {"name": "Dream Corps Canada", "description": "Dream Corps (DC) U of T Chapter promotes DC Canada and DC International in accordance with DC's mission: “to promote..."}, {"name": "Eastern Africa Students Association", "description": "Eastern Africa Students Association aims to powerfully engage the interests, voice and issues of Eastern Africa students at..."}, {"name": "Engineers Without Borders", "description": "EWB U of T empowers and unites individuals and organizations within the University of Toronto, Canada and Sub-Saharan Africa..."}, {"name": "Entrepreneurial Action Us", "description": "Enactus University of Toronto – Scarborough Campus (UTSC) is a student club that aims to utilize entrepreneurial action to..."}, {"name": "Equity Studies Student Union", "description": "Equity Studies Students' Union"}, {"name": "Ethics Society and Law Student Association", "description": "The Ethics, Society, and Law Students' Association is the undergraduate course union for the Ethics, Society, and Law program..."}, {"name": "Fair Trade Committee", "description": "Our goal is to make more Fair Trade products available to University of Toronto students, create awareness about Fair Trade,..."}, {"name": "Federation of Medical Women in Canada (FMWC)- Toronto Branch", "description": "As the local Toronto branch for the FMWC, we hope to uphold the organization's mandate in providing a supportive and friendly..."}, {"name": "Fight for $15 and Fairness UofT", "description": "FF15 - UofT is a student-led club that campaigns for the campaign goals of Ontario wide campaign, Fight for $15 and Fairness...."}, {"name": "Filipino Canadian Youth  Alliance/Ugnayan ng Kabataang Pilipino sa Canada", "description": "FCYA/UKPC is a dynamic group of Filipino Canadian youth and students. Through the guidance of the Philippine Women Centre, we..."}, {"name": "First Aid Society ", "description": "The University of Toronto First Aid Society provides First Aid training to members of the University of Toronto along with..."}, {"name": "Food Intolerance and Allergy Club", "description": "The mission statement of FOODIAC is to provide an opportunity for students with dietary restrictions to share their..."}, {"name": "Free the Children, at UTM", "description": "Free the Children (at UTM) is dedicated to raising awareness about the plight of children and their families in developing..."}, {"name": "Friends of Médecins Sans Frontières (Doctors Without Borders) – MSF U of T Chapter", "description": "The Friends of Médecins Sans Frontières - University of Toronto chapter is a student organisation fully affiliated with MSF..."}, {"name": "Friends of Medecins Sans Frontieres / Doctors Without Borders ", "description": "This organization aims support MSF Canada, an organization that provides medical care worldwide, to people caught in many..."}, {"name": "Frontier College @ U of T Scarborough", "description": "Frontier College at the University of Toronto Scarborough (FC@UTSC) is a Frontier College program that operates out of the U..."}, {"name": "Future-Living Lab", "description": "We are a student-run innovation lab where creative ideas come to life. We aim to overcome barriers to affordable living by..."}, {"name": "Generation H", "description": "GenHome builds a continual connection between the University of Toronto and the youth homeless shelters in Toronto. In..."}, {"name": "Get REAL University of Toronto", "description": "We are part of Get REAL - a movement of university students across Canada who speak to high schools about unlearning LGBTQ..."}, {"name": "Girl Up UofT", "description": "Girl Up is a global leadership development initiative, positioning girls to be leaders in the movement for gender equality. In..."}, {"name": "GLOBAL YOUTH IMPACT - UTSC Chapter", "description": "The purpose of GLOBAL YOUTH IMPACT - UTSC Chapter is to carry out activities as pertaining to the GLOBAL YOUTH IMPACT..."}, {"name": "Graduate Student Alliance for Global Health", "description": "The Graduate Student Alliance for Global Health will act as an interdisciplinary coalition of UofT students (from 3 campuses)..."}, {"name": "Graduate Students' Union (GSU)", "description": "The Graduate Students' Union at University of Toronto represents over 14,000 students studying in over 80 departments. For..."}, {"name": "Habitat for Humanity UTM ", "description": "Habitat for Humanity UTM (HFH UTM)  is a student chapter of Habitat for Humanity Canada which is a national, nonprofit..."}, {"name": "Habitat for Humanity UTSC", "description": "Habitat for Humanity UTSC is a student chapter of Habitat for Humanity GTA (Habitat GTA) and serves the U of T Scarborough..."}, {"name": "Habitat Friends @ UTSG ", "description": "Habitat Friends @ UTSG is a student chapter of Habitat for Humanity GTA (Habitat GTA) and serves the U of T St. George campus...."}, {"name": "HanVoice at UofT", "description": "HanVoice was started by three law students in 2007, concerned about the lack of an adequate Canadian response to one of the..."}, {"name": "Harry Potter Alliance UTSC - ScarBurrow", "description": "The Harry Potter Alliance (HPA) is a Dumbledore's Army for the real world. Founded in 2005, we're a non-profit organization..."}, {"name": "Hart House Debates & Dialogue Committee", "description": "The Hart House Debates & Dialogue Committee provides University of Toronto students opportunities to find and develop their..."}, {"name": "Hart House Social Justice Committee", "description": "The mission of the Hart House Social Justice Committee is to raise awareness of social justice issues through proactive..."}, {"name": "Health Out Loud ", "description": "The University of Toronto Chapter is part of the larger Health Out Loud non-profit organization. In order to alleviate health..."}, {"name": "Hear2Speak @ UTSC", "description": "The purpose of Hear2Speak @ UTSC is to improve speech and hearing care services and their accessibility in developing..."}, {"name": "Her Voice", "description": "Her Voice is a club that aims to increase the awareness of violence against women, providing them with a voice which will help..."}, {"name": "Hindu Campus Ministry", "description": "1. To propagate the message of the Vedas through the promotion of the Hindu lifestyle.\r\n\r\n2. To carry out social, cultural,..."}, {"name": "Horizons for Youth- U of T chapter", "description": "The goal of the organization is to assist and bring awareness to homelessness and at-risk youth, aged 16-24, within our city..."}, {"name": "Human Rights Watch University of Toronto Chapter", "description": "Human Rights Watch is an international non-governmental organization that conducts research an advocacy on violations of..."}, {"name": "Hygiene on Wheels UTSC", "description": "The purpose of HOW UTSC will be to provide dignity to people who are homeless in Toronto by supporting Hygiene on Wheel’s..."}, {"name": "In Visibility", "description": "In Visibility is a student-led organization seeking to initiate dialogue surrounding youth mental health. We act as a liaison..."}, {"name": "In Visibility", "description": "Our mission at In Visibility is to: \r\nact as a liaison between the club members and high school students, allowing them to..."}, {"name": "Indigenous Students Association", "description": "The ISA is committed to the spiritual, physical, emotional and mental well-being of the Indigenous (First Nations, Inuit, and..."}, {"name": "INpride", "description": "INpride is a student group based at Innis College that aims to support and advocate for students, especially those who..."}, {"name": "Interdisciplinary Global Health Club", "description": "Are you overwhelmed by climate change? Turn ANXIETY into ACTION by joining IGHC.\r\nInterdisciplinary Global Health Club (IGHC)..."}, {"name": "International Development Conference at UTSC", "description": "The purpose of the International Development Conference at the University of Toronto Scarborough Campus (UTSC) is to provide..."}, {"name": "International Development Studies Students' Association", "description": "The IDSSA is the Departmental Student Association representing all International Development Studies Students at the..."}, {"name": "International Health Program (UTIHP)", "description": "VISION:\r\n\r\nThe University of Toronto International Health Program (UTIHP) is the largest student-run charity on campus. It is..."}, {"name": "International Justice Mission: University of Toronto Chapter", "description": "IJMUT exists to fight against injustice and oppression in the world, through prayer and campus awareness events in..."}, {"name": "International Law and Human Rights Club", "description": "The main mission of the International Law and Human Rights club is to spread awareness of how international laws work in..."}, {"name": "International Law and Human Rights Club", "description": "The main mission of the International Law and Human Rights club is to spread awareness of how international laws work in..."}, {"name": "International Socialists", "description": "Where we stand:\r\n\r\n\r\nThe dead-end of capitalism\r\n\r\nThe capitalist system is based on violence, oppression and brutal..."}, {"name": "International Students Association", "description": "The mission of iNSA is to build an inclusive and open community for students coming to University of Toronto from different..."}, {"name": "Intersectionality", "description": "The purpose of this club is to spread awareness regarding the multiple forms systematic discrimination faced by people that..."}, {"name": "Islamic Relief at UTSC", "description": "The purpose of Islamic Relief Canada at UTSC will be to \"to alleviate suffering, hunger, illiteracy, and diseases worldwide..."}, {"name": "Jack.org at the University of Toronto Scarborough", "description": "Jack.org is a national network of student leaders working to change the way we think and talk about mental health. The UTSC..."}, {"name": "Jack.org UTM", "description": "Jack.org is the only national network of young leaders transforming the way we think about mental health. Jack.org operates..."}, {"name": "Jam for Justice", "description": "Founded in 2010, Jam for Justice (J4J) is a non-profit organization that uses music and the skills of local musicians to..."}, {"name": "Journalists for Human Rights Chapter", "description": "JHR's (Journalists for Human Rights) goal is to make everyone in the world fully aware of their rights. Creating rights..."}, {"name": "Juvenile Diabetes Research Foundation U of T", "description": "For over 40 years, JDRF has been a global leader in the search for an end to type 1 diabetes (T1D), through both research..."}, {"name": "Juxtaposition Global Health Magazine", "description": "Juxtaposition prides itself as a student-run magazine covering global health issues for the means of educating and motivating..."}, {"name": "Kiva Lending Team", "description": "UTKiva is a campus group founded and supported entirely by students of U of T, aiming to collect donations for Kiva. Kiva is a..."}, {"name": "Leap Chapter UofT: The Student Voice on Environmental Justice", "description": "Leap UofT is a student activist group working for climate justice.  We have relaunched UofT's fossil fuel divestment campaign,..."}, {"name": "Legal Literacy Club ", "description": "The Legal Literacy Club at the University of Toronto St George Campus aims to educate its members on fundamental legal..."}, {"name": "Lesbians, Gays, Bisexuals and Trans People of the University of Toronto (LGBTOUT)", "description": "Originally founded as the University of Toronto Homophile Association in 1969, LGBTOUT is the oldest LGBTQ (Lesbian, Gay,..."}, {"name": "Lifeguarding Society - Scarborough", "description": "Our mission is to educate the University of Toronto Scarborough community on Lifeguarding. This encompasses, but is not..."}, {"name": "Love146 University of Toronto", "description": "Love146 is an international human rights organization working to end child trafficking and exploitation through survivor care..."}, {"name": "Materials Chemistry Student Union", "description": "The Materials Chemistry Student Union is an organization dedicated to connecting students taking the Materials Science POSt..."}, {"name": "Maternal And Natal Health Initiative ", "description": "The Maternal And Natal Health Initiative strives to raise awareness and advocate for maternal and natal health improvement."}, {"name": "Men's Issues Awareness at the University of Toronto", "description": "We recognize the need to build a movement centred on Men’s Issues which will engage in consciousness-raising, public..."}, {"name": "Mental Unity Group", "description": "The Mental Unity Group (TMUG) is composed of a collection students that aim for a stronger UTSC community, equipped with the..."}, {"name": "Mercy Ships Club at the University of Toronto", "description": "Mercy Ships is a global charity that provides free medical and other services to the world’s poor.  Currently, Mercy Ships..."}, {"name": "Multi-Organ Transplant Insight, Outreach, and Networking Society at University of Toronto Scarborough", "description": "MOTIONS@UTSC is an organization that I would like to start after being part of a MOTIONS@St. George debate at Toronto General..."}, {"name": "Multi-Organ Transplant Insight, Outreach, and Networking Society University of Toronto", "description": "The Multi-Organ Transplant Insight, Outreach, & Networking Society (MOTIONS) aims to encourage awareness of organ failure and..."}, {"name": "Musical Minds Community Outreach", "description": "Musical Minds Community Outreach is a student-driven volunteer organization at the University of Toronto. We strive to make..."}, {"name": "MusicBox Children's Charity - University of Toronto Chapter", "description": "MusicBox Children’s Charity (MBCC) is a youth-run registered non-profit organization that strives to provide music education..."}, {"name": "National Society of Black Engineers (NSBE), U of T Chapter ", "description": "With more than 23,000 members worldwide, the National Society of Black Engineers (NSBE), founded in 1975, is the largest..."}, {"name": "NDP Socialist Caucus U of T Club", "description": "The Socialist Caucus of the New Democratic Party, U of T Club, promotes socialist policies, seeks to increase membership in..."}, {"name": "Neurodegenerative Disease Society of Toronto", "description": "“Neurodegenerative Disease Society of Toronto” is an organization that promotes the awareness of neurodegenerative..."}, {"name": "New Democratic Party (NDP)", "description": "The U of T NDP is a progressive group on campus dedicated to social justice. We support environmental sustainability, reducing..."}, {"name": "New Democratic Students of Scarborough", "description": "The New Democratic Students of Scarborough (NDSS) is a student-run club affiliated with the Ontario New Democratic Youth..."}, {"name": "New Roots Urban Agriculture", "description": "New Roots is a New College based environmental sustainability group with a focus on undergraduate community engagement."}, {"name": "NewPRIDE", "description": "NewPRIDE is a student group based at New College that strives to support, advocate for, and advance the interests of students..."}, {"name": "Out in Medicine", "description": "Out in Medicine is the University of Toronto Faculty of Medicine’s LGBTQ student\r\ngroup. We are dedicated to three main..."}, {"name": "OUT@UTM", "description": "OUT@UTM is dedicated to providing a campus atmosphere for LGBTTIQQ2SAO* students and their Allies that is both welcoming and..."}, {"name": "Oxfam Canada at UTSC", "description": "Oxfam Canada builds lasting solutions to global poverty\r\nand injustice. Oxfam Canada works with allies in Canada\r\nand around..."}, {"name": "Oxfam Canada- University of Toronto Chapter", "description": "Through advocacy and awareness campaigns, Oxfam U of T informs and empowers students to help find the lasting solutions to..."}, {"name": "Pakistan Development Foundation", "description": "The purpose of this group is to engage the Pakistani community across U of T in finding solutions for problems that exist..."}, {"name": "Pakistan Development Foundation (P.D.F.)", "description": "The aim of this club is to address the developmental issues facing Pakistan today. This will be done through:\r\n\r\n•Raising..."}, {"name": "Pre-Law Society", "description": "We are a student-administrated, campus-recognized organization committed to providing prospective law school students with..."}, {"name": "Pride of the Month", "description": "This club aims to raise money to provide sanitary hygiene products for girls in resource-poor countries. By doing so we are..."}, {"name": "Project 42", "description": "As quoted in The Hitchhiker's Guide to the Galaxy, the Answer to the Ultimate Question of Life, the Universe and Everything is..."}, {"name": "Psychological Health Society", "description": "The Psychological Health Society will raise awareness about issues related to psychological health by holding various events..."}, {"name": "RAINN", "description": "RAINN is the rape, abuse, and incest national network. This group, at the University of Toronto, will work to supply..."}, {"name": "Rare Disease Review Journal", "description": "Rare Disease Review is a medical & health policy journal focused on providing detailed discourse on rare diseases and their..."}, {"name": "RefugeAid UofT", "description": "RefugeAid UofT provides humanitarian aid in collaboration with Médecins Sans Frontières/Doctors without Borders (MSF) and..."}, {"name": "Regenesis ", "description": "Regenesis is a Canadian community environmental organization. Regenesis UTM creates and manages environmental initiatives and..."}, {"name": "Regenesis Scarborough", "description": "Regenesis Scarborough is the UTSC chapter of Regenesis, a Canadian student-involved university and college based environmental..."}, {"name": "Regenesis UofT", "description": "Regenesis UofT is the University of Toronto chapter of Regenesis, a Canadian student-involved university and college based..."}, {"name": "Relay for Life - University of Toronto", "description": "RFL U of T is a student group that aims to raise awareness on all aspects of cancer, with the ultimate goal of educating..."}, {"name": "Revolutionary Student Movement-University of Toronto Scarborough Campus", "description": "The Revolutionary Student Movement (RSM) is a revolutionary, combative, militant, and anti-capitalist student movement. We..."}, {"name": "Room to Read Chapter", "description": "Room to read is a non-profit organization focusing on literacy and gender equality in education of children in low-income..."}, {"name": "Save the Children", "description": "Save the Children’s mission is to promote the safety and security of children on an international level. Many children..."}, {"name": "Scarborough Campus' Union Reform Club", "description": "The SCU Reform Club was formed to bring change to the socio-political culture and legal structure of the Scarborough Campus..."}, {"name": "Scarborough Model United Nations Conference", "description": "The goals of The University of Toronto Syrian Refugee Association is to bring Syrian refugee students to the University of..."}, {"name": "Science for Peace (SfP)", "description": "Science for Peace (uoft) is the University of Toronto Chapter of the Canadian organization Science for Peace, which consists..."}, {"name": "Secular Alliance", "description": "The University of Toronto Secular Alliance (UTSA) is dedicated to building a community for those adhering to secular..."}, {"name": "Sexual Diversity Studies Students’ Union", "description": "The Sexual Diversity Studies Students’ Union is a student-run course union that represents undergraduate students associated..."}, {"name": "Sexual Education and Peer Counselling Centre", "description": "SEC’s mission is to provide supplies, information, resources, and educational programming to the greater University of..."}, {"name": "SGI-UofT Buddhist Group", "description": "SGI U of T Buddhist club is a group for anyone interested in learning more about the philosophy and history of Buddhism...."}, {"name": "Socialist Action", "description": "The U of T Socialist Action Club is dedicated to the purpose of raising political awareness, actively supporting the struggles..."}, {"name": "Socialist Fightback Students", "description": "Socialist Fightback Students is a Marxist organization that seeks to organize socialist students in Quebec and Canada.\r\n\r\nWe..."}, {"name": "Stem Cell Club", "description": "Patients with blood cancers may require a stem cell transplant as part of their treatment. However, 80% of patients do not..."}, {"name": "StrengthIN", "description": "StrengthIN empowers high school and middle school students by teaching them to take care of their mental health. We believe..."}, {"name": "Student Christian Movement", "description": "The SCM at U of T is a branch of the SCM Canada, an 95-year-old national association of university-based, student-led groups..."}, {"name": "Student Parents Alliance", "description": "This group is comprised of student parents. The group will work to support student parents with mental, physical, emotional..."}, {"name": "Students for a Free Tibet - University of Toronto, St. George", "description": "Students for a Free Tibet (SFT) – UofT St. George works in solidarity with the Tibetan people in their struggle for freedom..."}, {"name": "Students for a Free Tibet -UTM", "description": "Students for a Free Tibet -UTM works in solidarity with the Tibetan people in their struggle for cultural preservation,..."}, {"name": "Students for Barrier-free Access (SBA)", "description": "To advocate for equity, access and the rights of students with disabilities at the University of Toronto through the provision..."}, {"name": "Students For Change", "description": "Students for Change is a gender-equity focused club that advocates for the rights of women and gender minorities, with an..."}, {"name": "Students for Life", "description": "UTSFL works to promote the dignity of human life from conception to natural death by various educational demonstrations..."}, {"name": "Students for Optimizing and Advocating Pharmacy Endeavours", "description": "The vision of SOAPE is to help the profession of Pharmacy evolve through the involvement and leadership of pharmacy students...."}, {"name": "Students for Partners in Health: Toronto", "description": "Students for Partners in Health:Toronto is a student-led non-profit organisation dedicated to promoting Partners in Health..."}, {"name": "Students in Support of Covenant House", "description": "Committee created for the purpose of raising funds for Covenant House, a homeless youth shelter, and to foster awareness of..."}, {"name": "Students Supporting Israel", "description": "We are a pro-Israel advocacy club made up of students who want to see a lasting peace in the Middle East. We are brought..."}, {"name": "Students Supporting UHN ", "description": "Students Supporting UHN raises funds for patient care, research, and education at University Health Network (UHN) in Toronto...."}, {"name": "Supporting Grassroots Initiatives ", "description": "Supporting for Grassroots Initiatives (SGI) is a student group dedicated to supporting a variety of non-profit grassroots..."}, {"name": "Sustainable City Toronto", "description": "Sustainable City Toronto (SCT)is primarily a database and monitoring centre where we can provide quantitative values for..."}, {"name": "Syria Solidarity Collective", "description": "The Syria Solidarity Collective is an anti-oppression group which strives for social justice for people in Syria."}, {"name": "Tampon Tuesday", "description": "The mission of Tampon Tuesday is to bring donations of feminine hygiene products to women in need and to raise awareness..."}, {"name": "Team Up Against Concussions – University of Toronto Chapter", "description": "Team Up Against Concussions – University of Toronto Chapter is a concussion education program for students and athletes...."}, {"name": "Television", "description": "The University of Toronto Television club (UTTV) is a creative outlet where students can put together their own films and..."}, {"name": "Thai Student Association", "description": "University of Toronto Thai Student Association (UTTSA) is a cultural group which purpose is to promote the diversity of..."}, {"name": "Thaqalayn Muslim Association (TMA)", "description": "The Thaqalayn Muslim Association is a non-affiliated Muslim student association at the University of Toronto. The St. George..."}, {"name": "The Centre for Women and Trans People at the University of Toronto", "description": "The Centre for Women and Trans People is committed to providing a safe, harassment-free drop in space for all women and trans..."}, {"name": "The Children Project", "description": "The Children Project is dedicated to creating awareness and fundraise for disabled youths in developing countries, primarily..."}, {"name": "The Citizens Foundation", "description": "This club will be a chapter of an existing charity organization called The Citizens Foundation. Its purpose is to raise money..."}, {"name": "The Citizens Foundation - University of Toronto", "description": "The purpose, objectives, mission and/or mandate of organization is outlined here:\r\n\r\n- Host social events for students, with..."}, {"name": "The Mosaic Fellows Network", "description": "The Mosaic Fellows Network is a group of University of Toronto students who are partaking in the Mosaic Institute's UofMosaic..."}, {"name": "The Olive Branch of Hope x UTSC", "description": "The Olive Branch of Hope is a student run club that is partnered with The Olive Branch of Hope organization as an outlet to..."}, {"name": "The Ontario Public Interest Research Group (OPIRG) - Toronto", "description": "OPIRG-Toronto is a U of T based and entirely student-funded group with a mandate for action, education and research on issues..."}, {"name": "The University of Toronto Peace of Mind", "description": "The University of Toronto Peace of Mind is a club/group that will be a chapter of the non-profit organization Peace of Mind..."}, {"name": "The UTSC Human Concern International for Orphans", "description": "Human Concern International for Orphans at UTSC is a non-profit charity organization that aims to raise awareness and funds..."}, {"name": "Toronto Autonomous Reading Group", "description": "The Toronto Autonomous Reading Group aims to create a space for members of UofT and broader communities to come together to..."}, {"name": "Toronto Students Against Impaired Driving", "description": "TSAID's purpose is to establish an outreach presence at the University of Toronto and within our community to advocate for..."}, {"name": "Toronto Students for Justice in Palestine", "description": "A University of Toronto Scarborough Campus based group promoting the equity of all and supremacy of none. It is organized to..."}, {"name": "Toronto Substitute Teachers' Action Caucus U of T Club", "description": "The Toronto Substitute Teachers' U of T Club is dedicated to the organization and advancement of substitute teachers,..."}, {"name": "Trek for Teens Club", "description": "The University of Toronto Trek for Teens Club will raise funds and awareness for homeless youth, with a particular emphasis on..."}, {"name": "U of T Chapter Sikh Student Association", "description": "Sikh Student Association: \r\nTo advance the particular interests of the group; to promote the interests of the students..."}, {"name": "U of T Pencils of Promise", "description": "Pencils of Promise (PoP) is a for-purpose organization that creates educational opportunities and improves education for..."}, {"name": "UMatter", "description": "ÜMatter is a student led initiative focused on increasing the well-being and mental health on campus. We are partnering with..."}, {"name": "UN Women University of Toronto ", "description": "Fulfill and advocate for the goals, objectives and mission of the United Nations Women organization. UN Women is the UN agency..."}, {"name": "UNICEF", "description": "As a student-run charity club founded in 2003, UNICEF UTSC has grown thanks to much support from its general members. Our..."}, {"name": "UNICEF UTM", "description": "UNICEF UTM identifies as \r\n“… a group of student advocates and volunteers fundraising for UNICEF Canada to build and..."}, {"name": "United Nations Foundations Girl Up Club at UTSC", "description": "Girl Up UTSC is a branch of the United Nations Foundation's Girl Up Campaign. We are a campus group dedicated to educating the..."}, {"name": "United Nations International Children's Emergency Fund (UNICEF)", "description": "U of T UNICEF, a university group directly affiliated with UNICEF Canada, strives to raise funds and promote awareness of..."}, {"name": "United with Center of Addiction and Mental Health", "description": "United with CAMH (UwiC) is a non-profit club at UTSC which strives to support the foundation of the Centre of Addiction and..."}, {"name": "University of Toronto Decentralized Tech Association", "description": "The University of Toronto Decentralized Tech Association ﴾UTDTA﴿ is a student run, nonprofit association dedicated to..."}, {"name": "University of Toronto Environmental Action", "description": "UTEA raises awareness about pressing environmental issues (e.g Indigenous water rights, sustainable energy, climate change,..."}, {"name": "University of Toronto Microfinance Initiative ", "description": "The University of Toronto Microfinance Initiative is aimed at promoting awareness and involvement in microfinance initiatives..."}, {"name": "University of Toronto Mississauga Global Brigades", "description": "Global Brigades at University of Toronto Mississauga is a secular, international student-operated volunteer organization whose..."}, {"name": "University of Toronto Refugee Alliance", "description": "The University of Toronto Refugee Alliance (UTRA) serves as the platform for raising awareness about global and local refugee..."}, {"name": "University of Toronto Scarborough Students for Life", "description": "The purpose of UTSCSFL is to advocate for the equal value and fundamental rights of all human life from fertilization to..."}, {"name": "University of Toronto Students for Liberty", "description": "University of Toronto Students for Liberty is an organization with the aim of connecting pro-liberty students at U of T to one..."}, {"name": "University of Toronto Students in Support of Free Speech", "description": "This group was created in response to the U of T Rally for Free Speech that took place on October 11, 2016 at the University..."}, {"name": "University of Toronto Young Greens", "description": "The University of Toronto Young Greens shall strive to exemplify and advance the core values of the Global Greens; ecological..."}, {"name": "University of Toronto's World of Women", "description": "The University of Toronto's World of Women understands the collection of cultures that create the immense diversity within the..."}, {"name": "UofT Against Malaria", "description": "Save the most lives possible in the most effective possible way. Just $2 puts a net on the ground in malaria-stricken parts of..."}, {"name": "UofT Students in Support of Covenant House ", "description": "As Canada’s largest agency serving at-risk, homeless and trafficked youth, Covenant House Toronto changes lives by providing..."}, {"name": "UTM AFFILIATE  - Sexual Education & Peer Support Centre", "description": "UTM SEC offers a number of free and confidential services to students of U of T at Mississauga.  The services currently..."}, {"name": "UTM AFFILIATE - Women's Centre", "description": "The UTM Women's Centre is a non-profit organization located on campus. Our mandate is to increase student awareness on issues..."}, {"name": "UTM Campus Conservatives", "description": "The UTM Campus Conservatives serve to unify, empower and protect conservative students and ideas on the UTM campus."}, {"name": "UTM Leukemia and Lymphoma Association ", "description": "The Leukemia and Lymphoma Association is dedicated to spreading the word about the various types of blood cancer and the..."}, {"name": "UTM Liberals", "description": "The club will create a friendly Political environment where all the members can practice politics through the events hosted...."}, {"name": "UTM Students for life", "description": "Formed in 2014, UTMSFL works to promote the dignity of human life from conception to natural death through various educational..."}, {"name": "UTSC Eating Disorders Association", "description": "The UTSC Eating Disorders Association is a non-profit group attempting to support students, staff, families, and those..."}, {"name": "UTSC in Support of the Canadian Red Cross", "description": "The purpose of the UTSC in Support of the Canadian Red Cross is to educate students, faculty and external groups about..."}, {"name": "UTSC Muslim Students' Association", "description": "The Muslim Students’ Association (MSA) at the University of Toronto Scarborough (UTSC) is dedicated to providing for the..."}, {"name": "UTSC Street Support", "description": "To provide support for the homeless through services such as the making and delivering of sandwiches, the organization of..."}, {"name": "Veg Club", "description": "The University of Toronto Veg Club is a student-run group that promotes Meatless Mondays across campus, hosts veg-friendly..."}, {"name": "Voice of Women for Peace - University of Toronto", "description": "VOW is one of the non-governmental organizations (NGO) cited by UNESCO’s standing committee in the working group report..."}, {"name": "WE: Free the Children", "description": "As a local affiliate of the international organization, Free The Children, the WE: Free the Children Club at U of T has a..."}, {"name": "Women and Gender Studies Student Alliance", "description": "The purpose of this organization is to provide a safe environment to encourage the discussion and application of an..."}, {"name": "Women and Gender Studies Students' Union", "description": "WGSSU acts as a source of information & support for University of Toronto students, working to combine student activism with..."}, {"name": "Women's Health Collective", "description": "The Women’s Health Collective (WHC) is an inclusive student-run initiative that aims to promote the health and well-being of..."}, {"name": "World University Service of Canada", "description": "Our purpose at World University Service of Canada (WUSC) UTSC local committee is to foster human development and global..."}, {"name": "Youth for Humanity", "description": "Youth for Humanity is a youth-run, non-profit organization that mobilizes today’s generation of youth in advocating for..."}]